grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
#pragma once 

/* --- OTG1_HS_HOST: USB 1 on the go high speed --------------------- */

/** @defgroup otg1_hs_host_registers USB 1 on the go high speed Register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCFG OTG_HS host configuration register **/
#define OTG1_HS_HOST_OTG_HS_HCFG			MMIO32(OTG1_HS_HOST_BASE + 0x00)
/** OTG1_HS_HOST_OTG_HS_HFIR OTG_HS Host frame interval register **/
#define OTG1_HS_HOST_OTG_HS_HFIR			MMIO32(OTG1_HS_HOST_BASE + 0x04)
/** OTG1_HS_HOST_OTG_HS_HFNUM OTG_HS host frame number/frame time remaining register **/
#define OTG1_HS_HOST_OTG_HS_HFNUM			MMIO32(OTG1_HS_HOST_BASE + 0x08)
/** OTG1_HS_HOST_OTG_HS_HPTXSTS OTG_HS_Host periodic transmit FIFO/queue status register **/
#define OTG1_HS_HOST_OTG_HS_HPTXSTS			MMIO32(OTG1_HS_HOST_BASE + 0x10)
/** OTG1_HS_HOST_OTG_HS_HAINT OTG_HS Host all channels interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HAINT			MMIO32(OTG1_HS_HOST_BASE + 0x14)
/** OTG1_HS_HOST_OTG_HS_HAINTMSK OTG_HS host all channels interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HAINTMSK			MMIO32(OTG1_HS_HOST_BASE + 0x18)
/** OTG1_HS_HOST_OTG_HS_HPRT OTG_HS host port control and status register **/
#define OTG1_HS_HOST_OTG_HS_HPRT			MMIO32(OTG1_HS_HOST_BASE + 0x40)
/** OTG1_HS_HOST_OTG_HS_HCCHAR0 OTG_HS host channel-0 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR0			MMIO32(OTG1_HS_HOST_BASE + 0x100)
/** OTG1_HS_HOST_OTG_HS_HCSPLT0 OTG_HS host channel-0 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT0			MMIO32(OTG1_HS_HOST_BASE + 0x104)
/** OTG1_HS_HOST_OTG_HS_HCINT0 OTG_HS host channel-11 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT0			MMIO32(OTG1_HS_HOST_BASE + 0x108)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK0 OTG_HS host channel-11 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK0			MMIO32(OTG1_HS_HOST_BASE + 0x10c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ0 OTG_HS host channel-11 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ0			MMIO32(OTG1_HS_HOST_BASE + 0x110)
/** OTG1_HS_HOST_OTG_HS_HCDMA0 OTG_HS host channel-0 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA0			MMIO32(OTG1_HS_HOST_BASE + 0x114)
/** OTG1_HS_HOST_OTG_HS_HCCHAR1 OTG_HS host channel-1 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR1			MMIO32(OTG1_HS_HOST_BASE + 0x120)
/** OTG1_HS_HOST_OTG_HS_HCSPLT1 OTG_HS host channel-1 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT1			MMIO32(OTG1_HS_HOST_BASE + 0x124)
/** OTG1_HS_HOST_OTG_HS_HCINT1 OTG_HS host channel-1 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT1			MMIO32(OTG1_HS_HOST_BASE + 0x128)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK1 OTG_HS host channel-1 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK1			MMIO32(OTG1_HS_HOST_BASE + 0x12c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ1 OTG_HS host channel-1 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ1			MMIO32(OTG1_HS_HOST_BASE + 0x130)
/** OTG1_HS_HOST_OTG_HS_HCDMA1 OTG_HS host channel-1 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA1			MMIO32(OTG1_HS_HOST_BASE + 0x134)
/** OTG1_HS_HOST_OTG_HS_HCCHAR2 OTG_HS host channel-2 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR2			MMIO32(OTG1_HS_HOST_BASE + 0x140)
/** OTG1_HS_HOST_OTG_HS_HCSPLT2 OTG_HS host channel-2 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT2			MMIO32(OTG1_HS_HOST_BASE + 0x144)
/** OTG1_HS_HOST_OTG_HS_HCINT2 OTG_HS host channel-2 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT2			MMIO32(OTG1_HS_HOST_BASE + 0x148)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK2 OTG_HS host channel-2 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK2			MMIO32(OTG1_HS_HOST_BASE + 0x14c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ2 OTG_HS host channel-2 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ2			MMIO32(OTG1_HS_HOST_BASE + 0x150)
/** OTG1_HS_HOST_OTG_HS_HCDMA2 OTG_HS host channel-2 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA2			MMIO32(OTG1_HS_HOST_BASE + 0x154)
/** OTG1_HS_HOST_OTG_HS_HCCHAR3 OTG_HS host channel-3 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR3			MMIO32(OTG1_HS_HOST_BASE + 0x160)
/** OTG1_HS_HOST_OTG_HS_HCSPLT3 OTG_HS host channel-3 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT3			MMIO32(OTG1_HS_HOST_BASE + 0x164)
/** OTG1_HS_HOST_OTG_HS_HCINT3 OTG_HS host channel-3 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT3			MMIO32(OTG1_HS_HOST_BASE + 0x168)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK3 OTG_HS host channel-3 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK3			MMIO32(OTG1_HS_HOST_BASE + 0x16c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ3 OTG_HS host channel-3 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ3			MMIO32(OTG1_HS_HOST_BASE + 0x170)
/** OTG1_HS_HOST_OTG_HS_HCDMA3 OTG_HS host channel-3 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA3			MMIO32(OTG1_HS_HOST_BASE + 0x174)
/** OTG1_HS_HOST_OTG_HS_HCCHAR4 OTG_HS host channel-4 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR4			MMIO32(OTG1_HS_HOST_BASE + 0x180)
/** OTG1_HS_HOST_OTG_HS_HCSPLT4 OTG_HS host channel-4 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT4			MMIO32(OTG1_HS_HOST_BASE + 0x184)
/** OTG1_HS_HOST_OTG_HS_HCINT4 OTG_HS host channel-4 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT4			MMIO32(OTG1_HS_HOST_BASE + 0x188)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK4 OTG_HS host channel-4 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK4			MMIO32(OTG1_HS_HOST_BASE + 0x18c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ4 OTG_HS host channel-4 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ4			MMIO32(OTG1_HS_HOST_BASE + 0x190)
/** OTG1_HS_HOST_OTG_HS_HCDMA4 OTG_HS host channel-4 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA4			MMIO32(OTG1_HS_HOST_BASE + 0x194)
/** OTG1_HS_HOST_OTG_HS_HCCHAR5 OTG_HS host channel-5 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR5			MMIO32(OTG1_HS_HOST_BASE + 0x1a0)
/** OTG1_HS_HOST_OTG_HS_HCSPLT5 OTG_HS host channel-5 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT5			MMIO32(OTG1_HS_HOST_BASE + 0x1a4)
/** OTG1_HS_HOST_OTG_HS_HCINT5 OTG_HS host channel-5 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT5			MMIO32(OTG1_HS_HOST_BASE + 0x1a8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5 OTG_HS host channel-5 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5			MMIO32(OTG1_HS_HOST_BASE + 0x1ac)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ5 OTG_HS host channel-5 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ5			MMIO32(OTG1_HS_HOST_BASE + 0x1b0)
/** OTG1_HS_HOST_OTG_HS_HCDMA5 OTG_HS host channel-5 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA5			MMIO32(OTG1_HS_HOST_BASE + 0x1b4)
/** OTG1_HS_HOST_OTG_HS_HCCHAR6 OTG_HS host channel-6 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR6			MMIO32(OTG1_HS_HOST_BASE + 0x1c0)
/** OTG1_HS_HOST_OTG_HS_HCSPLT6 OTG_HS host channel-6 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT6			MMIO32(OTG1_HS_HOST_BASE + 0x1c4)
/** OTG1_HS_HOST_OTG_HS_HCINT6 OTG_HS host channel-6 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT6			MMIO32(OTG1_HS_HOST_BASE + 0x1c8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK6 OTG_HS host channel-6 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK6			MMIO32(OTG1_HS_HOST_BASE + 0x1cc)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ6 OTG_HS host channel-6 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ6			MMIO32(OTG1_HS_HOST_BASE + 0x1d0)
/** OTG1_HS_HOST_OTG_HS_HCDMA6 OTG_HS host channel-6 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA6			MMIO32(OTG1_HS_HOST_BASE + 0x1d4)
/** OTG1_HS_HOST_OTG_HS_HCCHAR7 OTG_HS host channel-7 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR7			MMIO32(OTG1_HS_HOST_BASE + 0x1e0)
/** OTG1_HS_HOST_OTG_HS_HCSPLT7 OTG_HS host channel-7 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT7			MMIO32(OTG1_HS_HOST_BASE + 0x1e4)
/** OTG1_HS_HOST_OTG_HS_HCINT7 OTG_HS host channel-7 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT7			MMIO32(OTG1_HS_HOST_BASE + 0x1e8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK7 OTG_HS host channel-7 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK7			MMIO32(OTG1_HS_HOST_BASE + 0x1ec)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ7 OTG_HS host channel-7 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ7			MMIO32(OTG1_HS_HOST_BASE + 0x1f0)
/** OTG1_HS_HOST_OTG_HS_HCDMA7 OTG_HS host channel-7 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA7			MMIO32(OTG1_HS_HOST_BASE + 0x1f4)
/** OTG1_HS_HOST_OTG_HS_HCCHAR8 OTG_HS host channel-8 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR8			MMIO32(OTG1_HS_HOST_BASE + 0x200)
/** OTG1_HS_HOST_OTG_HS_HCSPLT8 OTG_HS host channel-8 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT8			MMIO32(OTG1_HS_HOST_BASE + 0x204)
/** OTG1_HS_HOST_OTG_HS_HCINT8 OTG_HS host channel-8 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT8			MMIO32(OTG1_HS_HOST_BASE + 0x208)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8 OTG_HS host channel-8 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8			MMIO32(OTG1_HS_HOST_BASE + 0x20c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ8 OTG_HS host channel-8 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8			MMIO32(OTG1_HS_HOST_BASE + 0x210)
/** OTG1_HS_HOST_OTG_HS_HCDMA8 OTG_HS host channel-8 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA8			MMIO32(OTG1_HS_HOST_BASE + 0x214)
/** OTG1_HS_HOST_OTG_HS_HCCHAR9 OTG_HS host channel-9 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR9			MMIO32(OTG1_HS_HOST_BASE + 0x220)
/** OTG1_HS_HOST_OTG_HS_HCSPLT9 OTG_HS host channel-9 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT9			MMIO32(OTG1_HS_HOST_BASE + 0x224)
/** OTG1_HS_HOST_OTG_HS_HCINT9 OTG_HS host channel-9 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT9			MMIO32(OTG1_HS_HOST_BASE + 0x228)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9 OTG_HS host channel-9 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9			MMIO32(OTG1_HS_HOST_BASE + 0x22c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ9 OTG_HS host channel-9 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9			MMIO32(OTG1_HS_HOST_BASE + 0x230)
/** OTG1_HS_HOST_OTG_HS_HCDMA9 OTG_HS host channel-9 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA9			MMIO32(OTG1_HS_HOST_BASE + 0x234)
/** OTG1_HS_HOST_OTG_HS_HCCHAR10 OTG_HS host channel-10 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR10			MMIO32(OTG1_HS_HOST_BASE + 0x240)
/** OTG1_HS_HOST_OTG_HS_HCSPLT10 OTG_HS host channel-10 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT10			MMIO32(OTG1_HS_HOST_BASE + 0x244)
/** OTG1_HS_HOST_OTG_HS_HCINT10 OTG_HS host channel-10 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT10			MMIO32(OTG1_HS_HOST_BASE + 0x248)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10 OTG_HS host channel-10 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10			MMIO32(OTG1_HS_HOST_BASE + 0x24c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ10 OTG_HS host channel-10 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10			MMIO32(OTG1_HS_HOST_BASE + 0x250)
/** OTG1_HS_HOST_OTG_HS_HCDMA10 OTG_HS host channel-10 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA10			MMIO32(OTG1_HS_HOST_BASE + 0x254)
/** OTG1_HS_HOST_OTG_HS_HCCHAR11 OTG_HS host channel-11 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR11			MMIO32(OTG1_HS_HOST_BASE + 0x260)
/** OTG1_HS_HOST_OTG_HS_HCSPLT11 OTG_HS host channel-11 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT11			MMIO32(OTG1_HS_HOST_BASE + 0x264)
/** OTG1_HS_HOST_OTG_HS_HCINT11 OTG_HS host channel-11 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT11			MMIO32(OTG1_HS_HOST_BASE + 0x268)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11 OTG_HS host channel-11 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11			MMIO32(OTG1_HS_HOST_BASE + 0x26c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ11 OTG_HS host channel-11 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11			MMIO32(OTG1_HS_HOST_BASE + 0x270)
/** OTG1_HS_HOST_OTG_HS_HCDMA11 OTG_HS host channel-11 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA11			MMIO32(OTG1_HS_HOST_BASE + 0x274)
/** OTG1_HS_HOST_OTG_HS_HCCHAR12 OTG_HS host channel-12 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR12			MMIO32(OTG1_HS_HOST_BASE + 0x278)
/** OTG1_HS_HOST_OTG_HS_HCSPLT12 OTG_HS host channel-12 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT12			MMIO32(OTG1_HS_HOST_BASE + 0x27c)
/** OTG1_HS_HOST_OTG_HS_HCINT12 OTG_HS host channel-12 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT12			MMIO32(OTG1_HS_HOST_BASE + 0x280)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK12 OTG_HS host channel-12 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK12			MMIO32(OTG1_HS_HOST_BASE + 0x284)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ12 OTG_HS host channel-12 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ12			MMIO32(OTG1_HS_HOST_BASE + 0x288)
/** OTG1_HS_HOST_OTG_HS_HCDMA12 OTG_HS host channel-12 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA12			MMIO32(OTG1_HS_HOST_BASE + 0x28c)
/** OTG1_HS_HOST_OTG_HS_HCCHAR13 OTG_HS host channel-13 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR13			MMIO32(OTG1_HS_HOST_BASE + 0x290)
/** OTG1_HS_HOST_OTG_HS_HCSPLT13 OTG_HS host channel-13 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT13			MMIO32(OTG1_HS_HOST_BASE + 0x294)
/** OTG1_HS_HOST_OTG_HS_HCINT13 OTG_HS host channel-13 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT13			MMIO32(OTG1_HS_HOST_BASE + 0x298)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK13 OTG_HS host channel-13 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK13			MMIO32(OTG1_HS_HOST_BASE + 0x29c)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ13 OTG_HS host channel-13 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ13			MMIO32(OTG1_HS_HOST_BASE + 0x2a0)
/** OTG1_HS_HOST_OTG_HS_HCDMA13 OTG_HS host channel-13 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA13			MMIO32(OTG1_HS_HOST_BASE + 0x2a4)
/** OTG1_HS_HOST_OTG_HS_HCCHAR14 OTG_HS host channel-14 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR14			MMIO32(OTG1_HS_HOST_BASE + 0x2a8)
/** OTG1_HS_HOST_OTG_HS_HCSPLT14 OTG_HS host channel-14 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT14			MMIO32(OTG1_HS_HOST_BASE + 0x2ac)
/** OTG1_HS_HOST_OTG_HS_HCINT14 OTG_HS host channel-14 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT14			MMIO32(OTG1_HS_HOST_BASE + 0x2b0)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14 OTG_HS host channel-14 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14			MMIO32(OTG1_HS_HOST_BASE + 0x2b4)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ14 OTG_HS host channel-14 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14			MMIO32(OTG1_HS_HOST_BASE + 0x2b8)
/** OTG1_HS_HOST_OTG_HS_HCDMA14 OTG_HS host channel-14 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA14			MMIO32(OTG1_HS_HOST_BASE + 0x2bc)
/** OTG1_HS_HOST_OTG_HS_HCCHAR15 OTG_HS host channel-15 characteristics register **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR15			MMIO32(OTG1_HS_HOST_BASE + 0x2c0)
/** OTG1_HS_HOST_OTG_HS_HCSPLT15 OTG_HS host channel-15 split control register **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT15			MMIO32(OTG1_HS_HOST_BASE + 0x2c4)
/** OTG1_HS_HOST_OTG_HS_HCINT15 OTG_HS host channel-15 interrupt register **/
#define OTG1_HS_HOST_OTG_HS_HCINT15			MMIO32(OTG1_HS_HOST_BASE + 0x2c8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15 OTG_HS host channel-15 interrupt mask register **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15			MMIO32(OTG1_HS_HOST_BASE + 0x2cc)
/** OTG1_HS_HOST_OTG_HS_HCTSIZ15 OTG_HS host channel-15 transfer size register **/
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15			MMIO32(OTG1_HS_HOST_BASE + 0x2d0)
/** OTG1_HS_HOST_OTG_HS_HCDMA15 OTG_HS host channel-15 DMA address register **/
#define OTG1_HS_HOST_OTG_HS_HCDMA15			MMIO32(OTG1_HS_HOST_BASE + 0x2d4)

/**@}*/


/** @defgroup otg1_hs_host_otg_hs_hcfg OTGHSHCFG OTG_HS host configuration register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCFG_FSLSS FS- and LS-only support **/
#define OTG1_HS_HOST_OTG_HS_HCFG_FSLSS		(1 << 2)

#define OTG1_HS_HOST_OTG_HS_HCFG_FSLSPCS_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCFG_FSLSPCS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcfg_fslspcs FSLSPCS FS/LS PHY clock select
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hfir OTGHSHFIR OTG_HS Host frame interval register
@{*/


#define OTG1_HS_HOST_OTG_HS_HFIR_FRIVL_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HFIR_FRIVL_MASK		0xffff
/** @defgroup otg1_hs_host_otg_hs_hfir_frivl FRIVL Frame interval
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hfnum OTGHSHFNUM OTG_HS host frame number/frame time remaining register
@{*/


#define OTG1_HS_HOST_OTG_HS_HFNUM_FTREM_SHIFT		16
#define OTG1_HS_HOST_OTG_HS_HFNUM_FTREM_MASK		0xffff
/** @defgroup otg1_hs_host_otg_hs_hfnum_ftrem FTREM Frame time remaining
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HFNUM_FRNUM_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HFNUM_FRNUM_MASK		0xffff
/** @defgroup otg1_hs_host_otg_hs_hfnum_frnum FRNUM Frame number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hptxsts OTGHSHPTXSTS OTG_HS_Host periodic transmit FIFO/queue status register
@{*/


