grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MC_SHIFT		20
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MC_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar5_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPTYP_SHIFT		18
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPTYP_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR5_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR5_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPDIR		(1 << 15)

#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar5_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR5_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt5 OTGHSHCSPLT5 OTG_HS host channel-5 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT5_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT5_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt5_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT5_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt5_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT5_PRTADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCSPLT5_PRTADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt5_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcint5 OTGHSHCINT5 OTG_HS host channel-5 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT5_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT5_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT5_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT5_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT5_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT5_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT5_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT5_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT5_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT5_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT5_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk5 OTGHSHCINTMSK5 OTG_HS host channel-5 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_BBERRM Babble error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_TXERRM Transaction error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_NYET response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_ACKM ACK response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_NAKM NAK response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_STALLM STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_STALLM		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK5_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK5_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz5 OTGHSHCTSIZ5 OTG_HS host channel-5 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ5_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ5_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz5_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma5 OTGHSHCDMA5 OTG_HS host channel-5 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA5_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA5_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma5_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcchar6 OTGHSHCCHAR6 OTG_HS host channel-6 characteristics register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR6_CHENA Channel enable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR6_CHENA		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCCHAR6_CHDIS Channel disable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR6_CHDIS		(1 << 30)
/** OTG1_HS_HOST_OTG_HS_HCCHAR6_ODDFRM Odd frame **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR6_ODDFRM		(1 << 29)

