grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
/** OTG1_HS_HOST_OTG_HS_HCCHAR8_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR8_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR8_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR8_EPDIR		(1 << 15)

#define OTG1_HS_HOST_OTG_HS_HCCHAR8_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR8_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar8_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar8_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt8 OTGHSHCSPLT8 OTG_HS host channel-8 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT8_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt8_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt8_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt8_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcint8 OTGHSHCINT8 OTG_HS host channel-8 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT8_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT8_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT8_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT8_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT8_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT8_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT8_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT8_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT8_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT8_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT8_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT8_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk8 OTGHSHCINTMSK8 OTG_HS host channel-8 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_BBERRM Babble error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_TXERRM Transaction error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_NYET response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_ACKM ACK response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_NAKM NAK response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_STALLM STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_STALLM		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK8_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK8_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz8 OTGHSHCTSIZ8 OTG_HS host channel-8 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz8_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz8_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz8_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma8 OTGHSHCDMA8 OTG_HS host channel-8 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA8_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA8_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma8_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcchar9 OTGHSHCCHAR9 OTG_HS host channel-9 characteristics register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR9_CHENA Channel enable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_CHENA		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCCHAR9_CHDIS Channel disable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_CHDIS		(1 << 30)
/** OTG1_HS_HOST_OTG_HS_HCCHAR9_ODDFRM Odd frame **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_ODDFRM		(1 << 29)

#define OTG1_HS_HOST_OTG_HS_HCCHAR9_DAD_SHIFT		22
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_DAD_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcchar9_dad DAD Device address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR9_MC_SHIFT		20
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_MC_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar9_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR9_EPTYP_SHIFT		18
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_EPTYP_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar9_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR9_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR9_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_EPDIR		(1 << 15)

