grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar9_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR9_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR9_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar9_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt9 OTGHSHCSPLT9 OTG_HS host channel-9 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT9_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT9_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt9_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT9_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt9_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT9_PRTADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCSPLT9_PRTADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt9_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcint9 OTGHSHCINT9 OTG_HS host channel-9 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT9_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT9_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT9_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT9_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT9_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT9_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT9_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT9_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT9_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT9_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT9_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT9_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk9 OTGHSHCINTMSK9 OTG_HS host channel-9 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_BBERRM Babble error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_TXERRM Transaction error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_NYET response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_ACKM ACK response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_NAKM NAK response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_STALLM STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_STALLM		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK9_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK9_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz9 OTGHSHCTSIZ9 OTG_HS host channel-9 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz9_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz9_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz9_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma9 OTGHSHCDMA9 OTG_HS host channel-9 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA9_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA9_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma9_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcchar10 OTGHSHCCHAR10 OTG_HS host channel-10 characteristics register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR10_CHENA Channel enable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_CHENA		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCCHAR10_CHDIS Channel disable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_CHDIS		(1 << 30)
/** OTG1_HS_HOST_OTG_HS_HCCHAR10_ODDFRM Odd frame **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_ODDFRM		(1 << 29)

#define OTG1_HS_HOST_OTG_HS_HCCHAR10_DAD_SHIFT		22
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_DAD_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcchar10_dad DAD Device address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR10_MC_SHIFT		20
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_MC_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar10_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR10_EPTYP_SHIFT		18
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_EPTYP_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar10_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR10_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR10_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_EPDIR		(1 << 15)

#define OTG1_HS_HOST_OTG_HS_HCCHAR10_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar10_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR10_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR10_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar10_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt10 OTGHSHCSPLT10 OTG_HS host channel-10 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT10_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT10_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt10_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT10_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt10_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT10_PRTADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCSPLT10_PRTADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt10_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

