grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
/** @defgroup otg1_hs_host_otg_hs_hcint10 OTGHSHCINT10 OTG_HS host channel-10 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT10_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT10_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT10_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT10_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT10_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT10_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT10_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT10_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT10_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT10_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT10_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT10_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk10 OTGHSHCINTMSK10 OTG_HS host channel-10 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_BBERRM Babble error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_TXERRM Transaction error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_NYET response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_ACKM ACK response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_NAKM NAK response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_STALLM STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_STALLM		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK10_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK10_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz10 OTGHSHCTSIZ10 OTG_HS host channel-10 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz10_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz10_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz10_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma10 OTGHSHCDMA10 OTG_HS host channel-10 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA10_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA10_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma10_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcchar11 OTGHSHCCHAR11 OTG_HS host channel-11 characteristics register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR11_CHENA Channel enable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_CHENA		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCCHAR11_CHDIS Channel disable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_CHDIS		(1 << 30)
/** OTG1_HS_HOST_OTG_HS_HCCHAR11_ODDFRM Odd frame **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_ODDFRM		(1 << 29)

#define OTG1_HS_HOST_OTG_HS_HCCHAR11_DAD_SHIFT		22
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_DAD_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcchar11_dad DAD Device address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR11_MC_SHIFT		20
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_MC_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar11_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR11_EPTYP_SHIFT		18
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_EPTYP_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar11_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR11_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR11_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_EPDIR		(1 << 15)

#define OTG1_HS_HOST_OTG_HS_HCCHAR11_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar11_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar11_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt11 OTGHSHCSPLT11 OTG_HS host channel-11 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT11_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt11_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


