grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt11_hubaddr HUBADDR Hub address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt11_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcint11 OTGHSHCINT11 OTG_HS host channel-11 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT11_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT11_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT11_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT11_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT11_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT11_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT11_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT11_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT11_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT11_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT11_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT11_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk11 OTGHSHCINTMSK11 OTG_HS host channel-11 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_BBERRM Babble error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_TXERRM Transaction error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_NYET response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_ACKM ACK response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_NAKM NAK response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_STALLM STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_STALLM		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK11_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK11_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz11 OTGHSHCTSIZ11 OTG_HS host channel-11 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz11_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz11_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz11_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma11 OTGHSHCDMA11 OTG_HS host channel-11 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA11_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA11_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma11_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcchar12 OTGHSHCCHAR12 OTG_HS host channel-12 characteristics register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR12_CHENA Channel enable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHENA		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCCHAR12_CHDIS Channel disable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_CHDIS		(1 << 30)
/** OTG1_HS_HOST_OTG_HS_HCCHAR12_ODDFRM Odd frame **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_ODDFRM		(1 << 29)

#define OTG1_HS_HOST_OTG_HS_HCCHAR12_DAD_SHIFT		22
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_DAD_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcchar12_dad DAD Device address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MC_SHIFT		20
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MC_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar12_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPTYP_SHIFT		18
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPTYP_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar12_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR12_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR12_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPDIR		(1 << 15)

#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar12_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar12_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt12 OTGHSHCSPLT12 OTG_HS host channel-12 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT12_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt12_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt12_hubaddr HUBADDR Hub address
@{*/
/**@}*/


