grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
/** @defgroup otg1_hs_host_otg_hs_hcint14 OTGHSHCINT14 OTG_HS host channel-14 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT14_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT14_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT14_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT14_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT14_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT14_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT14_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT14_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT14_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT14_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT14_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT14_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk14 OTGHSHCINTMSK14 OTG_HS host channel-14 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_BBERRM Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_TXERRM Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_ACKM ACKM response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_NAKM NAKM response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_STALLM STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_STALLM		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK14_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK14_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz14 OTGHSHCTSIZ14 OTG_HS host channel-14 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz14_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz14_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz14_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma14 OTGHSHCDMA14 OTG_HS host channel-14 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA14_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA14_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma14_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcchar15 OTGHSHCCHAR15 OTG_HS host channel-15 characteristics register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR15_CHENA Channel enable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHENA		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCCHAR15_CHDIS Channel disable **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_CHDIS		(1 << 30)
/** OTG1_HS_HOST_OTG_HS_HCCHAR15_ODDFRM Odd frame **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_ODDFRM		(1 << 29)

#define OTG1_HS_HOST_OTG_HS_HCCHAR15_DAD_SHIFT		22
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_DAD_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcchar15_dad DAD Device address
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MC_SHIFT		20
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MC_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar15_mc MC Multi Count (MC) / Error Count (EC)
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPTYP_SHIFT		18
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPTYP_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcchar15_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG1_HS_HOST_OTG_HS_HCCHAR15_LSDEV Low-speed device **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_LSDEV		(1 << 17)
/** OTG1_HS_HOST_OTG_HS_HCCHAR15_EPDIR Endpoint direction **/
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPDIR		(1 << 15)

#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPNUM_SHIFT		11
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_EPNUM_MASK		0x0f
/** @defgroup otg1_hs_host_otg_hs_hcchar15_epnum EPNUM Endpoint number
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_MASK		0x7ff
/** @defgroup otg1_hs_host_otg_hs_hcchar15_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcsplt15 OTGHSHCSPLT15 OTG_HS host channel-15 split control register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCSPLT15_SPLITEN Split enable **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_SPLITEN		(1 << 31)
/** OTG1_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT Do complete split **/
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT		(1 << 16)

#define OTG1_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_SHIFT		14
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hcsplt15_xactpos XACTPOS XACTPOS
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_SHIFT		7
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt15_hubaddr HUBADDR Hub address
@{*/
/**@}*/


