grevaillot/svd_tools/headers/STM32H7x5_CM4/otg1_hs_host.h
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_MASK		0x7f
/** @defgroup otg1_hs_host_otg_hs_hcsplt15_prtaddr PRTADDR Port address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcint15 OTGHSHCINT15 OTG_HS host channel-15 interrupt register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINT15_DTERR Data toggle error **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_DTERR		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINT15_FRMOR Frame overrun **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_FRMOR		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINT15_BBERR Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_BBERR		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINT15_TXERR Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_TXERR		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINT15_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINT15_ACK ACK response received/transmitted interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_ACK		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINT15_NAK NAK response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_NAK		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINT15_STALL STALL response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINT15_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINT15_CHH Channel halted **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_CHH		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINT15_XFRC Transfer completed **/
#define OTG1_HS_HOST_OTG_HS_HCINT15_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcintmsk15 OTGHSHCINTMSK15 OTG_HS host channel-15 interrupt mask register
@{*/

/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_DTERRM Data toggle error mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_DTERRM		(1 << 10)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_FRMORM Frame overrun mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_FRMORM		(1 << 9)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_BBERRM Babble error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_BBERRM		(1 << 8)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_TXERRM Transaction error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_TXERRM		(1 << 7)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_NYET Response received interrupt **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NYET		(1 << 6)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_ACKM ACK response received/transmitted interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_ACKM		(1 << 5)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_NAKM NAK response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_NAKM		(1 << 4)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_STALL STALL response received interrupt mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_STALL		(1 << 3)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_AHBERR AHB error **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_AHBERR		(1 << 2)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_CHHM Channel halted mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_CHHM		(1 << 1)
/** OTG1_HS_HOST_OTG_HS_HCINTMSK15_XFRCM Transfer completed mask **/
#define OTG1_HS_HOST_OTG_HS_HCINTMSK15_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hctsiz15 OTGHSHCTSIZ15 OTG_HS host channel-15 transfer size register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_DPID_SHIFT		29
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_DPID_MASK		0x03
/** @defgroup otg1_hs_host_otg_hs_hctsiz15_dpid DPID Data PID
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_SHIFT		19
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_MASK		0x3ff
/** @defgroup otg1_hs_host_otg_hs_hctsiz15_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_MASK		0x7ffff
/** @defgroup otg1_hs_host_otg_hs_hctsiz15_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg1_hs_host_otg_hs_hcdma15 OTGHSHCDMA15 OTG_HS host channel-15 DMA address register
@{*/


#define OTG1_HS_HOST_OTG_HS_HCDMA15_DMAADDR_SHIFT		0
#define OTG1_HS_HOST_OTG_HS_HCDMA15_DMAADDR_MASK		0xffffffff
/** @defgroup otg1_hs_host_otg_hs_hcdma15_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/
